metadata-api-createMetadata-custom-fields.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:met="http://soap.sforce.com/2006/04/metadata" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <met:SessionHeader>
            <met:sessionId>{{SessionId}}</met:sessionId>
        </met:SessionHeader>
    </soapenv:Header>
    <soapenv:Body>
        <met:createMetadata>
            <metadata xsi:type="met:CustomField">
                <fullName>Invoice__c.Invoice_Date__c</fullName>
                <label>Invoice Date</label>
                <type>Date</type>
                <description>Date when invoice was generated</description>
            </metadata>
            <metadata xsi:type="met:CustomField">
                <fullName>Invoice__c.Invoice_No__c</fullName>
                <label>Invoice No</label>
                <type>Text</type>
                <length>20</length>
                <description>Invoice Number</description>
                <unique>true</unique>
                <required>true</required>
            </metadata>
            <metadata xsi:type="met:CustomField">
                <fullName>Invoice__c.Remarks__c</fullName>
                <label>Remarks</label>
                <type>TextArea</type>
                <description>Invoice Remarks</description>
            </metadata>
            <metadata xsi:type="met:CustomField">
                <fullName>Invoice__c.Amount__c</fullName>
                <label>Amount</label>
                <type>Currency</type>
                <precision>18</precision>
                <scale>2</scale>
                <description>Total Invoice Amount</description>
            </metadata>
            <metadata xsi:type="met:CustomField">
                <fullName>Invoice__c.Paid__c</fullName>
                <label>Paid</label>
                <type>Checkbox</type>
                <defaultValue>false</defaultValue>
                <description>Has this Invoice been paid?</description>
            </metadata>
            <metadata xsi:type="met:CustomField">
                <fullName>Invoice__c.Status__c</fullName>
                <label>Status</label>
                <type>Picklist</type>
                <description>Status of the Invoice</description>
                <valueSet>
                    <restricted>true</restricted>
                    <valueSetDefinition>
                        <sorted>false</sorted>
                        <value>
                            <fullName>Draft</fullName>
                            <default>false</default>
                            <label>Draft</label>
                        </value>
                        <value>
                            <fullName>Sent</fullName>
                            <default>false</default>
                            <label>Sent</label>
                        </value>
                        <value>
                            <fullName>Paid</fullName>
                            <default>false</default>
                            <label>Paid</label>
                        </value>
                        <value>
                            <fullName>Cancelled</fullName>
                            <default>false</default>
                            <label>Cancelled</label>
                        </value>
                    </valueSetDefinition>
                </valueSet>
            </metadata>
        </met:createMetadata>
    </soapenv:Body>
</soapenv:Envelope>
